{
  "id": 12,
  "title": "Living the Quarantined Life",
  "markdown": "There's a lot of chaos going on around the world, and lots of changes thanks to the novel COVID-19 pandemic. However, even though there's a lot of tension and stress due to this, there's always ways to enjoy the little things. Recently Nintendo Switch released a new game. My fiance has played the previous games before, and this is the first time I get to play this game franchise. Animal Crossing: New Horizon couldn't have come at a better time.\r\n\r\nACNH has been out for a little over a week and by far it has been extremely fun. My fiancee and I have been both playing it together and it helps specially when we have to socially distance ourselves. While it may be tough to a lot of people, specially with cavin-fever, I have been perfectly handling the situation. I think this is part of always enjoying staying indoors playing videogames, as well as a bit of being an introvert. I really enjoy that the game is pretty laid back and that you can invite friends to your island.\r\n\r\nIf you don't want to invite friends, you can visit them instead. In worst case scenario where you don't know anyone else that has the game, there's always NPCs called Villagers who make the game enjoyable nonetheless. Sometimes things can get a little slow, but that's ok. The game is meant to be taken at your own pace. Once more things start getting unlocked, the more options you'll have to choose from.\r\n\r\n---\r\n\r\nAnyway, it's been a while since I've shared something, and since we're being socially distanced (quarantined) I figured I should update my blog for a bit and talk about what I've been doing lately. My old MPB laptop died earlier this year, and I decided to try linux again. It's been almost 9 years since I've last used a linux operating system outside of Apple so I was excited to see what was out there. I started shopping for a decent machine that would last me for a while, but was under $1,000. Out of the many machine options out there, I ended up deciding between an HP Pavilion or Dell Latitude.\r\n\r\nAll in all, I ended up getting the HP Pavilion because of the newer processor (i7-1065G7 vs i7-8650u) and it having an M.2 drive versus an SSD. Once I had my hardware selected, I still needed an operating system. I had previously used Ubuntu, and I wanted to try something new. TLDR; I'm still using Ubuntu. I first started looking into CentOS, Mint Linux, Fedora, and lastly Ubuntu. I originally picked CentOS because I wanted to develop on OS used closer to servers. This would allow me to use a terminal and minimal GUI. Unfortunately, due to the M.2 drive, I was unable to install Centos, Fedora, and Mint Linux. Luckily, Ubuntu was able to detect the M.2 drive and I was set on an Operating System.\r\n\r\nI've been enjoying setting up my new machine and re-learning the different keybindings between Windows, Mac, and Linux. While it's a small nuance, I still prefer to program in Linux than on a Windows machine. Well that's all I have for now, I will keep doing my part to help flatten the curve and I hope everyone is stay safe.",
  "linkIcon": "fa-gamepad",
  "linkText": "",
  "imageLink": "articles/acnh-quarantine.jpeg",
  "createdAt": "Mar 28, 2020"
}
